hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_slave_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <string.h>
#include <assert.h>
#include "fsl_dspi_slave_driver.h"
//#include "fsl_interrupt_manager.h"
//#include "fsl_clock_manager.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*!
 * @brief Flags of DSPI slave event.
 *
 * DSPI event used to notify user that it finishes the task.
 */
typedef enum _dspi_event_flags {
    kDspiTransferDone = 0x01,       /*!< Transferring done flag */
} dspi_event_flag_t;

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Table of base addresses for DSPI instances. */
extern const uint32_t g_dspiBaseAddr[];

/*! @brief Table to save DSPI IRQ enum numbers defined in CMSIS header file. */
extern const IRQn_Type g_dspiIrqId[SPI_INSTANCE_COUNT];

/* Pointer to runtime state structure.*/
extern void * g_dspiStatePtr[SPI_INSTANCE_COUNT];

/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * @brief Finish up a transfer.
 * Cleans up after a transfer is complete. Interrupts are disabled, and the DSPI module
 * is disabled. This is not a public API as it is called from other driver functions.
 */
static void DSPI_DRV_SlaveCompleteTransfer(uint32_t instance);
/*!
 * @brief DSPI Slave Generic IRQ handler.
 *
 * This handler check errors of driver and it puts data into Tx FIFO, gets data
 * from Rx FIFO whenever data transmitting/received.
 * This is not a public API as it is called whenever an interrupt occurs.
 */
static void DSPI_DRV_SlaveStartTransfer(uint32_t instance,
                                        const uint8_t *sendBuffer,
                                        uint8_t *receiveBuffer,
                                        uint32_t transferCount);
/*!
 * @brief Fill up the TX FIFO with data.
 * This function fills up the TX FIFO with initial data for start of transfers where
 * it will first clear the transfer count.  Otherwise, if the TX FIFO fill is part
 * of an ongoing transfer then do not clear the transfer count.
 * This is not a public API as it is called from other driver functions.
 */
static void DSPI_DRV_SlaveFillUpTxFifo(uint32_t instance);
/*!
 * @brief DSPI Slave Generic IRQ handler.
 *
 * This handler check errors of driver and it puts data into Tx FIFO, gets data
 * from Rx FIFO whenever data transmitting/received.
 * This is not a public API as it is called whenever an interrupt occurs.
 */
void DSPI_DRV_SlaveIRQHandler(uint32_t instance)
{
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];
    dspi_slave_state_t *dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    uint8_t nBytes;

    // Calculate number of bytes in a frame
    nBytes = dspiState->bitsPerFrame >> 3;      // Number of bytes is bits/frame devide 8
    if ((dspiState->bitsPerFrame & 0x07) != 0)  // Bits/frame module 8 is not zero
    {
        nBytes += 1;
    }

    // Architectural note: Service the TX interrupt first to queue up the next data to send, then
    // service the RX interrupt.  Finally, check for any TX underflow or RX overflow conditions.

    // Fill the Tx FIFO if required
    DSPI_DRV_SlaveFillUpTxFifo(instance);

    // Because SPI protocol is sync, so the number of byte that slave received from master is real
    // number of byte that slave transmitted to master. So we only monitor received size to know
    // when transferring is completed.
    if (dspiState->remainingReceiveByteCount > 0)
    {
        // Read data if remaining receive byte > 0
        uint32_t dataReceived; // Maximum supported data bit length in slave mode is 32-bits

        while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
        {
            // Have received data in the buffer.
            dataReceived = DSPI_HAL_ReadData(baseAddr);
            // clear the rx fifo drain request, needed for non-DMA applications as this flag
            // will remain set even if the rx fifo is empty. By manually clearing this flag, it
            // either remain clear if no more data is in the fifo, or it will set if there is
            // more data in the fifo.
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

