hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_slave_driver.c
            // If bits/frame is one byte
            if (nBytes == 1)
            {
                if (dspiState->receiveBuffer)
                {
                    // Receive buffer is not null, store data into it
                    *dspiState->receiveBuffer = dataReceived;
                    ++dspiState->receiveBuffer;
                }

                // Descrease remaining receive byte count
                --dspiState->remainingReceiveByteCount;
            }
            // If bits/frame is 2 bytes
            else if (nBytes == 2)
            {
                // With multibytes frame receiving, we only receive till the received size
                // matches user request. Other bytes will be ignored.
                if (dspiState->receiveBuffer)
                {
                    // Receive buffer is not null, store first byte into it
                    *dspiState->receiveBuffer = dataReceived;
                    ++dspiState->receiveBuffer;

                    if (--dspiState->remainingReceiveByteCount > 0)
                    {
                        // Receive buffer is not null, store second byte into it
                        *dspiState->receiveBuffer = dataReceived >> 8;
                        ++dspiState->receiveBuffer;
                    }

                    // Decrease remaining receive byte count
                    --dspiState->remainingReceiveByteCount;
                }
                else
                {
                    // receive buffer is null, just decrease remaining byte count
                    dspiState->remainingReceiveByteCount -= 2;
                }
            }
            // If bits/frame is 3 bytes
            else if (nBytes == 3)
            {
                // With multibytes frame receiving, we only receive till the received size
                // matches user request. Other bytes will be ignored.
                if (dspiState->receiveBuffer)
                {
                    // Receive buffer is not null, store first byte into it
                    *dspiState->receiveBuffer = dataReceived;
                    ++dspiState->receiveBuffer;

                    if (--dspiState->remainingReceiveByteCount > 0)
                    {
                        // Receive buffer is not null, store second byte into it
                        *dspiState->receiveBuffer = dataReceived >> 8;
                        ++dspiState->receiveBuffer;
                    }

                    if (--dspiState->remainingReceiveByteCount > 0)
                    {
                        // Receive buffer is not null, store third byte into it
                        *dspiState->receiveBuffer = dataReceived >> 16;
                        ++dspiState->receiveBuffer;
                    }

                    // Decrease remaining receive byte count
                    --dspiState->remainingReceiveByteCount;
                }
                else
                {
                    // receive buffer is null, just decrease remaining byte count
                    dspiState->remainingReceiveByteCount -= 3;
                }
            }
            // If bits/frame is 4 bytes
            else
            {
                // With multibytes frame receiving, we only receive till the received size
                // matches user request. Other bytes will be ignored.
                if (dspiState->receiveBuffer)
                {
                    // Receive buffer is not null, store first byte into it
                    *dspiState->receiveBuffer = dataReceived;
                    ++dspiState->receiveBuffer;

                    if (--dspiState->remainingReceiveByteCount > 0)
                    {
                        // Receive buffer is not null, store second byte into it
                        *dspiState->receiveBuffer = dataReceived >> 8;
                        ++dspiState->receiveBuffer;
                    }

                    if (--dspiState->remainingReceiveByteCount > 0)
                    {
                        // Receive buffer is not null, store third byte into it
                        *dspiState->receiveBuffer = dataReceived >> 16;
                        ++dspiState->receiveBuffer;
                    }

                    if (--dspiState->remainingReceiveByteCount > 0)
                    {
                        // Receive buffer is not null, store fourth byte into it
                        *dspiState->receiveBuffer = dataReceived >> 24;
                        ++dspiState->receiveBuffer;
                    }

                    // Decrease remaining receive byte count
                    --dspiState->remainingReceiveByteCount;
                }
                else
                {
                    // receive buffer is null, just decrease remaining byte count
                    dspiState->remainingReceiveByteCount -= 4;
                }
            }
            if (dspiState->remainingReceiveByteCount <= 0)
            {
                break;
            }
        }
    }
    // Check if remaining receive byte count matches user request
    if (dspiState->remainingReceiveByteCount <= 0)
    {
        // Other cases, stop the transfer.
        DSPI_DRV_SlaveCompleteTransfer(instance);
        return;
    }

    // catch tx fifo underflow conditions, service only if tx under flow interrupt enabled
    if ((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoUnderflow)) &&
        (DSPI_HAL_GetIntMode(baseAddr, kDspiTxFifoUnderflow)))
    {
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoUnderflow);
        // Change state to error and clear flag
        dspiState->status = kStatus_DSPI_Error;
        dspiState->errorCount++;
    }
    // catch rx fifo overflow conditions, service only if rx over flow interrupt enabled
    if ((DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoOverflow)) &&
        (DSPI_HAL_GetIntMode(baseAddr, kDspiRxFifoOverflow)))
    {
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoOverflow);
        // Change state to error and clear flag
        dspiState->status = kStatus_DSPI_Error;
        dspiState->errorCount++;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveInit
 * Description   : Initialize a DSPI slave instance.
 * Un-gate its clock, initialize required resources.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveInit(uint32_t instance,
                                 dspi_slave_state_t * dspiState,
                                 const dspi_slave_user_config_t * slaveConfig)
{
    dspi_status_t errorCode = kStatus_DSPI_Success;
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];

    // Check parameter pointer is not NULL
    if ((dspiState == NULL) || (slaveConfig == NULL))
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // Check DSPI slave instance is already initialized
    if (g_dspiStatePtr[instance])
    {
        return kStatus_DSPI_Initialized;
    }

