hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_slave_driver.c
    // Check bits/frame number
    if (slaveConfig->dataConfig.bitsPerFrame > 32)
    {
        return kStatus_DSPI_Initialized;
    }

    // Clear the run-time state struct for this instance.
    memset(dspiState, 0, sizeof(* dspiState));

    // Initial default value for ring buffer
    dspiState->status = kStatus_DSPI_Success;
    dspiState->errorCount = 0;
    dspiState->dummyPattern = slaveConfig->dummyPattern;
    dspiState->remainingSendByteCount = 0;
    dspiState->remainingReceiveByteCount = 0;
    dspiState->isTransferInProgress = false;
    dspiState->receiveBuffer = NULL;
    dspiState->sendBuffer = NULL;

    // configure the run-time state struct with the nubmer of bits/frame
    dspiState->bitsPerFrame = slaveConfig->dataConfig.bitsPerFrame;

    // Enable clock for DSPI
    SIM_SET_SCGC6(SIM, SIM_SCGC6_SPI0_MASK);

    // Reset the DSPI module, which also disables the DSPI module
    DSPI_HAL_Init(baseAddr);

    // Set to slave mode.
    DSPI_HAL_SetMasterSlaveMode(baseAddr, kDspiSlave);

    errorCode = DSPI_HAL_SetDataFormat(baseAddr, kDspiCtar0, &slaveConfig->dataConfig);

    // Enable fifo operation (regardless of FIFO depth)
    DSPI_HAL_SetFifoCmd(baseAddr, true, true);

    // DSPI system enable
    DSPI_HAL_Enable(baseAddr);

    // flush the fifos
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    // Configure IRQ state structure, so irq handler can point to the correct state structure
    g_dspiStatePtr[instance] = dspiState;

    // Clear the Tx FIFO Fill Flag (TFFF) status bit
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);

    // Enable the interrupt
    NVIC_EnableIRQ(g_dspiIrqId[instance]);

    // Enable the module
    DSPI_HAL_Enable(baseAddr);

    /* Start the transfer process in the hardware */
    DSPI_HAL_StartTransfer(baseAddr);

    return errorCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveDeinit
 * Description   : Shutdown a DSPI instance.
 * Resets the DSPI peripheral, disables the interrupt to the core, and gates its clock.
 *
 *END**************************************************************************/
void DSPI_DRV_SlaveDeinit(uint32_t instance)
{
    // instantiate local variable of type dspi_slave_state_t and equate it to the
    // pointer to state
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];

    // Validate function parameters
    assert(instance < SPI_INSTANCE_COUNT);

    if (!dspiState)
    {
        return;
    }

    // disable the interrupt
    NVIC_DisableIRQ(g_dspiIrqId[instance]);

    // Stop the transfer process in the slave
    DSPI_HAL_StopTransfer(baseAddr);

    // Wait until the DSPI run status signals that is has halted before shutting
    // down the module and before gating off the DSPI clock source.  Otherwise, if the DSPI
    // is shut down before it has halted it's internal processes, it may be left in an unknown
    // state.
    // Note that if the master slave select is still asserted, the run status will never clear.
    // Hence, ensure before shutting down the slave that the master has de-asserted the slave
    // select signal (it should be high if slave select active low or it should be low if
    // slave select is active high).
    while((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxAndRxStatus))) { }

    // Restore the module to defaults then power it down. This also disables the DSPI module.
    DSPI_HAL_Init(baseAddr);

    // Gate the clock for DSPI.
    SIM_CLR_SCGC6(SIM, SIM_SCGC6_SPI0_MASK);

    // Clear state pointer.
    g_dspiStatePtr[instance] = NULL;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveFillUpTxFifo
 * Description   : This function fills up the TX FIFO with initial data for start of transfers
 * where it will first clear the transfer count.  Otherwise, if the TX FIFO fill is part of an
 * ongoing transfer then do not clear the transfer count.  The param "isInitialData" is used
 * to determine if this is an initial data fill.
 *END**************************************************************************/
static void DSPI_DRV_SlaveFillUpTxFifo(uint32_t instance)
{
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];
    uint32_t transmitData = 0; // Maximum supported data bit length in slave mode is 32-bits
    uint8_t nBytes = 0;

    // Calculate number of bytes in a frame
    nBytes = dspiState->bitsPerFrame >> 3;
    if ((dspiState->bitsPerFrame & 0x07) != 0)
    {
        nBytes += 1;
    }

    // Service the transmitter, if transmit buffer provided, transmit the data, else transmit dummy pattern
    while(DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest))
    {
        // transmit data
        if(dspiState->remainingSendByteCount > 0)
        {
            // Have data to transmit, update the transmit data and push to FIFO
            if(nBytes == 1)
            {
                // bits/frame is 1 byte

                if (dspiState->sendBuffer)
                {
                    // Update transmit data and transmit pointer
                    transmitData = *dspiState->sendBuffer;
                    dspiState->sendBuffer++;
                }
                else
                {
                    transmitData = dspiState->dummyPattern;
                }

                // Decrease remaining size
                --dspiState->remainingSendByteCount;
            }
            // bits/frame is 2 bytes
            else if (nBytes == 2)
            {
                // With multibytes per frame transmission, the transmit frame contains data from
                // transmit buffer until sent size matches user request. Other bytes will set to
                // dummy pattern value.

                if (dspiState->sendBuffer)
                {
                    // Update first byte of transmit data and transmit pointer
                    transmitData = *dspiState->sendBuffer;
                    dspiState->sendBuffer++;

                    // Check if send completed, decrease remaining size
                    if(--dspiState->remainingSendByteCount > 0)
                    {
                        // Update second byte of transmit data and transmit pointer
                        transmitData |= (uint32_t)(*dspiState->sendBuffer) << 8;
                        dspiState->sendBuffer++;
                    }
                    else
                    {
                        // Update second byte of transmit data to second byte of dummy pattern
                        transmitData |= dspiState->dummyPattern & 0xFF00;
                    }

                    // Decrease remaining size
                    --dspiState->remainingSendByteCount;
                }
                else
                {
                    // Decrease remaining size
                    dspiState->remainingSendByteCount -= 2;
                    transmitData = dspiState->dummyPattern;
                }
            }
            // bits/frame is 3 bytes
            else if (nBytes == 3)
            {
                // With multibytes per frame transmission, the transmit frame contains data from
                // transmit buffer until sent size matches user request. Other bytes will set to
                // dummy pattern value.

                if (dspiState->sendBuffer)
                {
                    // Update first byte of transmit data and transmit pointer
                    transmitData = *dspiState->sendBuffer;
                    dspiState->sendBuffer++;

                    // Check if send completed, decrease remaining size
                    if(--dspiState->remainingSendByteCount > 0)
                    {
                        // Update second byte of transmit data and transmit pointer
                        transmitData |= (uint32_t)(*dspiState->sendBuffer) << 8;
                        dspiState->sendBuffer++;
                    }
                    else
                    {
                        // Update second byte of transmit data to second byte of dummy pattern
                        transmitData |= dspiState->dummyPattern & 0xFF00;
                    }

                    // Check if send completed, decrease remaining size
                    if(--dspiState->remainingSendByteCount > 0)
                    {
                        // Update third byte of transmit data and transmit pointer
                        transmitData |= (uint32_t)(*dspiState->sendBuffer) << 16;
                        dspiState->sendBuffer++;
                    }
                    else
                    {
                        // Update third byte of transmit data to third byte of dummy pattern
                        transmitData |= dspiState->dummyPattern & 0xFF0000;
                    }

                    // Decrease remaining size
                    --dspiState->remainingSendByteCount;
                }
                else
                {
                    transmitData = dspiState->dummyPattern;
                    // Decrease remaining size
                    dspiState->remainingSendByteCount -= 3;
                }
            }
            // bits/frame is 4 bytes
            else
            {
                // With multibytes per frame transmission, the transmit frame contains data from
                // transmit buffer until sent size matches user request. Other bytes will set to
                // dummy pattern value.

                if (dspiState->sendBuffer)
                {
                    // Update first byte of transmit data and transmit pointer
                    transmitData = *dspiState->sendBuffer;
                    dspiState->sendBuffer++;

                    // Check if send completed, decrease remaining size
                    if(--dspiState->remainingSendByteCount > 0)
                    {
                        // Update second byte of transmit data and transmit pointer
                        transmitData |= (uint32_t)(*dspiState->sendBuffer) << 8;
                        dspiState->sendBuffer++;
                    }
                    else
                    {
                        // Update second byte of transmit data to second byte of dummy pattern
                        transmitData |= dspiState->dummyPattern & 0xFF00;
                    }

                    // Check if send completed, decrease remaining size
                    if(--dspiState->remainingSendByteCount > 0)
                    {
                        // Update third byte of transmit data and transmit pointer
                        transmitData |= (uint32_t)(*dspiState->sendBuffer) << 16;
                        dspiState->sendBuffer++;
                    }
                    else
                    {
                        // Update third byte of transmit data to third byte of dummy pattern
                        transmitData |= dspiState->dummyPattern & 0xFF0000;
                    }

                    // Check if send completed, decrease remaining size
                    if(--dspiState->remainingSendByteCount > 0)
                    {
                        // Update fourth byte of transmit data and transmit pointer
                        transmitData |= (uint32_t)(*dspiState->sendBuffer) << 24;
                        dspiState->sendBuffer++;
                    }
                    else
                    {
                        // Update fourth byte of transmit data to fourth byte of dummy pattern
                        transmitData |= dspiState->dummyPattern & 0xFF000000;
                    }

                    // Decrease remaining size
                    --dspiState->remainingSendByteCount;
                }
                else
                {
                    transmitData = dspiState->dummyPattern;
                    // Decrease remaining size
                    dspiState->remainingSendByteCount -= 4;
                }
            }
        }
        else
        {
            // Nothing to transmit, send dummy pattern to master
            transmitData = dspiState->dummyPattern;
        }

        // Write the data to the DSPI data register
        DSPI_HAL_WriteDataSlavemode(baseAddr, transmitData);
        // try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveStartTransfer
 * Description   : Starts transfer data on SPI bus using interrupt and non-blocking call
 * Start DSPI transfering, update transmit/receive information into slave state structure
 *
 *END**************************************************************************/
static void DSPI_DRV_SlaveStartTransfer(uint32_t instance,
                                        const uint8_t *sendBuffer,
                                        uint8_t *receiveBuffer,
                                        uint32_t transferCount)
{
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];

    // Save information about the transfer for use by the ISR.
    dspiState->isTransferInProgress = true;

    // Store transfer information
    dspiState->sendBuffer = sendBuffer;
    dspiState->receiveBuffer = receiveBuffer;
    dspiState->remainingSendByteCount = transferCount;
    dspiState->remainingReceiveByteCount = transferCount;
    dspiState->errorCount = 0;

    // Restart the transfer by stop then start again, this will clear out the shift register
    DSPI_HAL_StopTransfer(baseAddr);

    // flush the fifos
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    // Clear status flags that may have been set from previous transfers
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiEndOfQueue);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoUnderflow);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoOverflow);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

    // Clear the transfer count
    DSPI_HAL_PresetTransferCount(baseAddr, 0);

