hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_slave_driver.c
    // Start the transfer, make sure to do this before filling the FIFO
    DSPI_HAL_StartTransfer(baseAddr);

    // Prepare data to transmit
    DSPI_DRV_SlaveFillUpTxFifo(instance);

    // Enable RX FIFO drain request, the slave only use this interrupt
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, true);
    if(receiveBuffer)
    {
        // RX FIFO overflow request enable
        DSPI_HAL_SetIntMode(baseAddr, kDspiRxFifoOverflow, true);
    }
    if (sendBuffer)
    {
        // TX FIFO underflow request enable
        DSPI_HAL_SetIntMode(baseAddr, kDspiTxFifoUnderflow, true);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveCompleteTransfer
 * Description   : Finish the transfer
 * Called when transfer is finished
 *
 *END**************************************************************************/
static void DSPI_DRV_SlaveCompleteTransfer(uint32_t instance)
{
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];

    // The transfer is complete.
    dspiState->isTransferInProgress = false;
    dspiState->sendBuffer = NULL;
    dspiState->receiveBuffer = NULL;
    dspiState->remainingReceiveByteCount = 0;
    dspiState->remainingSendByteCount = 0;

    // Disable interrupt requests
    // RX FIFO Drain request: RFDF_RE
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, false);

    // Disable TX FIFO Fill request
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, false);

    // TX FIFO underflow request disable
    DSPI_HAL_SetIntMode(baseAddr, kDspiTxFifoUnderflow, false);

    // RX FIFO overflow request disable
    DSPI_HAL_SetIntMode(baseAddr, kDspiRxFifoOverflow, false);

    // Update DSPI status
    dspiState->status = kStatus_DSPI_Success;

}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveTransfer
 * Description   : Transfer data to master
 * Start transfer data to master
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveTransfer(uint32_t instance,
                                     const uint8_t *sendBuffer,
                                     uint8_t *receiveBuffer,
                                     uint32_t transferByteCount)
{
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];

    // Check validation of parameters
    assert(instance < SPI_INSTANCE_COUNT);

    // Check driver initialization and idle
    if(!dspiState)
    {
        return kStatus_DSPI_NonInit;
    }
    if (kStatus_DSPI_Success != dspiState->status)
    {
        return dspiState->status;
    }

    // If receive length is zero
    if (transferByteCount == 0)
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // If both send buffer and receive buffer is null
    if ((!sendBuffer) && (!receiveBuffer))
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // If DSPI is in transmitting or receving process, return busy
    if (dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_Busy;
    }

    // Marks function to async
    dspiState->isSync = false;

    DSPI_DRV_SlaveStartTransfer(instance, sendBuffer, receiveBuffer, transferByteCount);
    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveTransferBlocking
 * Description   : Transfer data - blocking
 * Transfer data - blocking
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveTransferBlocking(uint32_t instance,
                                             const uint8_t *sendBuffer,
                                             uint8_t *receiveBuffer,
                                             uint32_t transferByteCount,
                                             uint32_t timeout)
{
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    osa_status_t osaStatus = kStatus_OSA_Success;
    dspi_status_t result = kStatus_DSPI_Success;

    // Check validation of parameters
    assert(instance < SPI_INSTANCE_COUNT);

    // Check driver initialization and idle
    if(!dspiState)
    {
        return kStatus_DSPI_NonInit;
    }
    if (kStatus_DSPI_Success != dspiState->status)
    {
        return dspiState->status;
    }

    // If receive length is zero, return success immediately without any data
    if (transferByteCount == 0)
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // If both send buffer and receive buffer is null
    if ((!sendBuffer) && (!receiveBuffer))
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // If DSPI is in transmitting or receving process, return busy
    if (dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_Busy;
    }

    // Marks function to sync
    dspiState->isSync = true;

    // Start transfer
    DSPI_DRV_SlaveStartTransfer(instance, sendBuffer, receiveBuffer, transferByteCount);

    // wait transfer finished
    do
    {
//        osaStatus = OSA_EventWait(&dspiState->event, kDspiTransferDone, true, timeout, &setFlags);
    } while(osaStatus == kStatus_OSA_Idle);

    // Check status of OSA wait event
    switch (osaStatus)
    {
        case kStatus_OSA_Success:
            result = kStatus_DSPI_Success;
            break;
        case kStatus_OSA_Timeout:
            result = kStatus_DSPI_Timeout;
            break;
        case kStatus_OSA_Error:
        default:
            result = kStatus_DSPI_Error;
            break;
    }

    return result;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveAbortTransfer
 * Description   : Abort tranfer
 * Abort data transfer, using after function DSPI_DRV_SlaveTransfer() to abort
 * transfering data
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveAbortTransfer(uint32_t instance)
{
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];

    // Check instance is valid or not
    assert(instance < SPI_INSTANCE_COUNT);

    // Check driver is initialized
    if (!dspiState)
    {
        return kStatus_DSPI_NonInit;
    }

    // Check transfer is in progress
    if (!dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_NoTransferInProgress;
    }

    // Stop transfer
    DSPI_DRV_SlaveCompleteTransfer(instance);

    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveGetTransferStatus
 * Description   : Returns whether the previous transfer has finished yet.
 * When performing an async transfer, the user can call this function to ascertain the state of the
 * current transfer: in progress (or busy) or complete (success). In addition, if the transfer
 * is still in progress, the user can obtain the number of words that have been currently
 * transferred.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveGetTransferStatus(uint32_t instance, uint32_t * framesTransferred)
{
    // instantiate local variable of type dspi_slave_state_t and point to global state
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    SPI_Type * baseAddr = (SPI_Type *)g_dspiBaseAddr[instance];

    // Fill in the bytes transferred if required
    if (framesTransferred)
    {
        *framesTransferred = DSPI_HAL_GetTransferCount(baseAddr);
    }

    // return success if non transferring is in progress
    return ((dspiState->isTransferInProgress) ? kStatus_DSPI_Busy : kStatus_DSPI_Success);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
